Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: If you prefer manual installation, you can also clone the LVGL repository into the ``lib/`` directory of your PlatformIO project.
it_it: Se si preferisce l'installazione manuale, si può clonare il repository LVGL nella directory ``lib/`` del proprio progetto PlatformIO.

source: If you prefer not to edit ``lv_conf.h``, the same can be achieved by adding build flags in ``platformio.ini``:
it_it: Se si preferisce non modificare ``lv_conf.h``, si può ottenere lo stesso risultato aggiungendo flag di build in ``platformio.ini``:

source: If you prefer not to use LovyanGFX, you can integrate other graphics libraries as well by implementing a wrapper class in the same way LovyanGFX is handled; `lv_lgfx_user.hpp <https://github.com/lvgl/lvgl/blob/master/src/drivers/display/lovyan_gfx/lv_lgfx_user.hpp>`__ provides a good example of this.
it_it: Se si preferisce di non utilizzare LovyanGFX, si possono integrare anche altre librerie grafiche implementando una classe wrapper nello stesso modo in cui viene gestita LovyanGFX; `lv_lgfx_user.hpp <https://github.com/lvgl/lvgl/blob/master/src/drivers/display/lovyan_gfx/lv_lgfx_user.hpp>`__ ne è un buon esempio.

source: If you prefer to build for a specific architecture and variant, go to the appropriate directory and run `make` there.
it_it: Se si preferisce compilare per un'architettura e una variante specifiche, si va alla directory appropriata e si esegue `make` da lì.

source: If you prefer to learn by examples, the Furo-theme Examples and especially the Kitchen Sink Page are excellent resources.
it_it: Se si preferisce imparare tramite esempi, gliEsempi Furo-theme e in particolare la "Kitchen Sink Page" [Pagina Riassuntiva] sono ottime risorse.

source: If you prefer, you can also edit the ``platformio.ini`` file directly and add the libraries under lib_deps:
it_it: Si può anche modificare direttamente il file ``platformio.ini`` e aggiungere le librerie in lib_deps:

source: If you press the encoder on a complex "editable" object (like a list, message box, etc.), the widget will go into *Edit mode*, allowing you to navigate inside the object by turning the encoder.
it_it: Se si preme l'encoder su un oggetto "modificabile" complesso (come una lista, una finestra di messaggio, ecc.), il widget entrerà in *Edit mode*, consentendo di navigare all'interno dell'oggetto ruotando l'encoder.

source: If you provide your own custom Path function, its prototype is:
it_it: Se si fornisce una funzione Path personalizzata, il suo prototipo è:

source: If you provide your own data-value arrays, each array so provided must contain at least this number of values.
it_it: Se si forniscono array di valori dati personalizzati, ogni array fornito deve contenere almeno questo numero di valori.

source: If you require a hardware decoder, you must manually specify it using ``lv_ffmpeg_player_set_decoder``, such as ``h264_v4l2m2m``.
it_it: Se è necessario un decoder hardware, è necessario specificarlo manualmente utilizzando ``lv_ffmpeg_player_set_decoder``, ad esempio ``h264_v4l2m2m``.

source: If you see this error:
it_it: Se si vede l'errore:

source: If you set :c:macro:`LV_FILE_EXPLORER_QUICK_ACCESS` to ``0`` in ``lv_conf.h``, the ``Quick-Access Panel`` will not be created.
it_it: Se si imposta :c:macro:`LV_FILE_EXPLORER_QUICK_ACCESS` a ``0`` in ``lv_conf.h``, il ``Pannello Quick-Access`` non verrà creato.

source: If you set the column and/or row grid descriptors of a widget to ``NULL`` it will use the grid descriptor(s) from it's parent.
it_it: Se si impostano i descrittori di grid di colonna e/o riga di un widget su ``NULL``, verranno utilizzati i descrittori di grid del genitore.

source: If you set up LVGL to use more than one display, be aware that some functions use the :ref:`default_display` during their execution, such as creating :ref:`screens`.
it_it: Se si imposta LVGL per utilizzare più di un display, tenere presente che alcune funzioni utilizzano il :ref:`default_display` durante la loro esecuzione, ad esempio la creazione di :ref:`screens`.

source: If you use Windows API shim libraries like `YY-Thunks <https://github.com/Chuyu-Team/YY-Thunks>`__, the tested minimum OS version is Windows XP RTM.
it_it: Se si utilizzano librerie shim API Windows come `YY-Thunks <https://github.com/Chuyu-Team/YY-Thunks>`__, la versione minima del sistema operativo testata è Windows XP RTM.

source: If you use a custom keymap (see below), set the :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_POPOVER` flag for each key for which a pop-over should be shown.
it_it: Se si utilizza una mappa di controllo personalizzata (vedere di seguito), impostare il flag :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_POPOVER` per ogni tasto per cui si desidera visualizzare un pop-over.

source: If you use an RTOS:
it_it: Se si usa un RTOS:

source: If you use another editor or IDE you can always write scripts to automate the building/pushing/pulling operations.
it_it: Se si usa un altro editor o IDE, si può sempre scrivere script per automatizzare le operazioni di compilazione/pushing/pulling.

source: If you use cmake to install lvgl, 3 folders will be created.
it_it: Se si utilizza cmake per installare lvgl, verranno create 3 cartelle.

source: If you use more than one, each associated identifier letter you use must be unique.
it_it: Se ne viene usato più di uno, ogni lettera identificativa associata deve essere univoca.

source: If you use this option, you will need to set its repeat count (to either ``-1`` or a positive repeat count, since it will have decremented to ``0``) and :ref:`resume <timer_pause_and_resume>` it to make it active again.
it_it: Se si utilizza questa opzione, sarà necessario impostarne il conteggio delle ripetizioni (su ``-1`` o su un conteggio positivo, poiché sarà decrementato a ``0``) e :ref:`resume <timer_pause_and_resume>` per riattivarlo.

source: If you used it earlier, it will appear among the "Recents".
it_it: Se è già stato utilizzato in precedenza, apparirà tra i "Recents".

source: If you want FreeType to use LVGL's memory allocation and file system interface, you can enable :c:macro:`LV_FREETYPE_USE_LVGL_PORT` in ``lv_conf.h``, convenient for unified management.
it_it: Se si desidera che FreeType utilizzi l'allocazione di memoria e l'interfaccia del file system di LVGL, è possibile abilitare :c:macro:`LV_FREETYPE_USE_LVGL_PORT` in ``lv_conf.h``, utile per una gestione unificata.

source: If you want a plot to start from a point other than the default which is ``point[0]`` of the series, you can set an alternative index with the function :cpp:expr:`lv_chart_set_x_start_point(chart, series, id)` where ``id`` is the new zero-based index position to start plotting from.
it_it: Per far sì che un grafico inizi da un punto diverso da quello predefinito, ovvero ``point[0]`` della serie, è possibile impostare un indice alternativo con la funzione :cpp:expr:`lv_chart_set_x_start_point(chart, series, id)` dove ``id`` la nuova posizione dell'indice a base zero da cui iniziare il grafico.

source: If you want labels to be drawn with the major ticks, call :cpp:expr:`lv_scale_set_label_show(scale, true)`.
it_it: Per far sì che le etichette vengano disegnate con le tacche maggiori, si chiama :cpp:expr:`lv_scale_set_label_show(scale, true)`.

source: If you want more information on BitBake, see the `BitBake User Manual <https://docs.yoctoproject.org/bitbake/2.
it_it: Per maggiori informazioni su BitBake, consultare il `Manuale Utente di BitBake <https://docs.yoctoproject.org/bitbake/2.

source: If you want to add an [OK] or [Cancel] or other buttons for the user to have a choice of responses, add each button using the :cpp:expr:`lv_msgbox_add_footer_button(msgbox, btn_text)` function.
it_it: Per aggiungere un pulsante [OK], [Cancel] o altri pulsanti per consentire all'utente di scegliere tra diverse risposte, aggiungere ciascun pulsante utilizzando la funzione :cpp:expr:`lv_msgbox_add_footer_button(msgbox, btn_text)`.

source: If you want to build any of the other demo applications check out the samples `README <https://docs.zephyrproject.org/latest/samples/modules/lvgl/demos/README.html>`__.
it_it: Per compilare una qualsiasi delle altre applicazioni demo, consultare gli esempi `README <https://docs.zephyrproject.org/latest/samples/modules/lvgl/demos/README.html>`__.

source: If you want to cancel an asynchronous call, call :cpp:expr:`lv_async_call_cancel(my_function, data_p)`, which will remove all asynchronous calls matching ``my_function`` and ``data_p``.
it_it: Per annullare una chiamata asincrona, si chiama :cpp:expr:`lv_async_call_cancel(my_function, data_p)`, che rimuoverà tutte le chiamate asincrone corrispondenti a ``my_function`` e a ``data_p``.

source: If you want to connect a keyboard device to a textarea, create a dedicated input group and set it on both the indev and textarea.
it_it: Per collegare una tastiera a un'area di testo, creare un gruppo di input dedicato e impostarlo sia sull'indev che sulla textarea.

source: If you want to create something like the built-in fonts (Montserrat font and symbols) but in a different size and/or ranges, you can use the ``built_in_font_gen.py`` script in ``lvgl/scripts/built_in_font`` folder.
it_it: Per creare qualcosa di simile ai font nativi (font e simboli Montserrat) ma con dimensioni e/o intervalli diversi, si può utilizzare lo script ``built_in_font_gen.py`` nella cartella ``lvgl/scripts/built_in_font``.

source: If you want to ensure the SDK was generated with lvgl being installed, go to the path you extracted the SDK and find all lvgl files:
it_it: Per assicurarsi che l'SDK sia stato generato con lvgl installato, si va al path in cui è stato estratto l'SDK e si trovano tutti i file lvgl:

source: If you want to experiment with LVGL + MicroPython without downloading anything, you can use our online simulator!
it_it: Per sperimentare con LVGL + MicroPython senza scaricare nulla, si può usare il simulatore online!

source: If you want to find all devices that have a specific capability, use ``lv_libinput_find_devs``.
it_it: Per trovare tutti i dispositivi con una funzionalità specifica, utilizzare ``lv_libinput_find_devs``.

source: If you want to pause the monkey, call :cpp:expr:`lv_monkey_set_enable(monkey, false)`.
it_it: Per mettere in pausa Monkey, si chiama :cpp:expr:`lv_monkey_set_enable(monkey, false)`.

source: If you want to run a subprocess from inside of a generation script and read the output from stdout:
it_it: Per eseguire un sottoprocesso dall'interno di uno script di generazione e leggere l'output da stdout:

source: If you want to set a property for all states (e.g. red background color) just set it for the default state.
it_it: Per impostare una proprietà per tutti gli stati (ad esempio, il colore di sfondo rosso), è sufficiente impostarla sullo stato di default.

source: If you want to skip any particular hook you can do so with:
it_it: Si può saltare un hook in particolare, con:

source: If you want to skip the drive-letter prefix in Unix-like paths, you can use the :c:macro:`LV_FS_DEFAULT_DRIVER_LETTER` config parameter.
it_it: Per ignorare il prefisso della lettera di unità nei percorsi di tipo Unix, è possibile utilizzare il parametro di configurazione :c:macro:`LV_FS_DEFAULT_DRIVER_LETTER`.

source: If you want to use :cpp:func:`lv_timer_handler` in a super-loop, a helper function :cpp:func:`lv_timer_handler_run_in_period` is provided to simplify supplying LVGL with time awareness:
it_it: Per utilizzare :cpp:func:`lv_timer_handler` in un super-loop, è disponibile la funzione helper :cpp:func:`lv_timer_handler_run_in_period` per semplificare l'impostazione di LVGL con la gestione del tempo:

source: If you want to use EGL without being tied to DRM, you can enable ``LV_USE_EGL`` using a compiler definition.
it_it: Per utilizzare EGL senza essere vincolati a DRM, si può abilitare ``LV_USE_EGL`` utilizzando una definizione del compilatore.

source: If you want to use a different Path (including a custom Path function you provide), you set it using :cpp:expr:`lv_anim_set_path_cb(&anim_template, path_cb)`.
it_it: Per utilizzare un Path diverso (inclusa una funzione Path personalizzata fornita), è possibile impostarlo utilizzando :cpp:expr:`lv_anim_set_path_cb(&anim_template, path_cb)`.

source: If you want to use another interface to output log information (e.g. stdout), you can redirect the log output using the following code:
it_it: Per utilizzare un'altra interfaccia per l'output delle informazioni di log (ad esempio stdout), è possibile reindirizzare l'output del log utilizzando il seguente codice:

source: If you want to use the Chinese calendar, please use :cpp:expr:`lv_calendar_set_chinese_mode(calendar, true)` to enable it.
it_it: Per utilizzare il calendario cinese, si usa :cpp:expr:`lv_calendar_set_chinese_mode(calendar, true)` per abilitarlo.

source: If you wish to have the chart use your own Y-value array instead of the one provided, you can do so with
it_it: Se si desidera che il grafico utilizzi il proprio array di valori Y invece di quello fornito, lo si può fare con

source: If you wish to use a profiler method provided by your operating system, you can modify the following macros in ``lv_conf.h``:
it_it: Per utilizzare un metodo di profiler fornito dal sistema operativo, è possibile modificare le seguenti macro in ``lv_conf.h``:

source: If you wish, you can provide custom implementations for several Widget-ID related functions.
it_it: Si possono fornire implementazioni personalizzate per diverse funzioni relative ai Widget-ID.

source: If you would like the CPU to sleep or be scheduled to other RTOS tasks while a DMA2D transfer is ongoing, do the following:
it_it: Per far andare la CPU in sospensione o pianificarla per altre attività RTOS mentre è in corso un trasferimento DMA2D, procedere come segue:

source: If you're using a framework, ensure it will not be in contention with LVGL over the DMA2D peripheral.
it_it: Se si sta usando un framework, assicurarsi che non sia in conflitto con LVGL sulla periferica DMA2D.

source: If your ESP32 chip does not have SPIRAM you will face severe limitations in render size.
it_it: Se il chip ESP32 non dispone di SPIRAM, si incontreranno gravi limitazioni nelle dimensioni di rendering.

source: If your Label is updated with new strings rapidly (e.g. > 30X / second, such as RPM in a dashboard, or an ADC value), and the length of those strings changes frequently, it is advisable to:
it_it: Se l'etichetta viene aggiornata rapidamente con nuove stringhe (ad esempio > 30X/secondo, come RPM in una dashboard o un valore ADC) e la lunghezza di tali stringhe cambia frequentemente, è consigliabile:

source: If your OS is NOT integrated with LVGL, then these calls either return immediately with no effect, or are optimized away by the linker.
it_it: Se il sistema operativo NON è integrato con LVGL, queste chiamate o terminano immediatamente senza alcun effetto, oppure vengono ottimizzate dal linker.

source: If your OS is integrated with LVGL (the macro :c:macro:`LV_USE_OS` has a value other than ``LV_OS_NONE`` in ``lv_conf.h``) you can use :cpp:func:`lv_lock()` and :cpp:func:`lv_unlock()` to perform #1 and #2.
it_it: Se il sistema operativo è integrato con LVGL (la macro :c:macro:`LV_USE_OS` ha un valore diverso da ``LV_OS_NONE`` in ``lv_conf.h``) si possono usare :cpp:func:`lv_lock()` e :cpp:func:`lv_unlock()` per eseguire i punti #1 e #2.

source: If your ``settings.json`` looks like this initially...
it_it: Se il ``settings.json`` inizialmente appare così...

source: If your contribution fulfills the requirements of the DCO, no further action is needed.
it_it: Se il contributo soddisfa i requisiti del DCO, non sono necessarie ulteriori azioni.

source: If your device doesn't show up, you may have to configure udev and the appropriate udev rules to connect it.
it_it: Se il dispositivo non venisse visualizzato, potrebbe essere necessario configurare udev e le regole udev appropriate per connetterlo.

source: If your display has an SPI port consider changing to a model with a parallel interface because it has much higher throughput.
it_it: Se il display ha una porta SPI, valutare la possibilità di passare a un modello con interfaccia parallela, poiché offre una velocità di elaborazione molto più elevata.

source: If your display is :ref:`one that LVGL has a driver for <display controllers>`, you should use it so that you have less driver logic to implement in your project.
it_it: Se il display è :ref:`uno per cui LVGL ha un driver <display controllers>`, lo si dovrebbe usare in modo da avere meno logica del driver da implementare nel progetto.

source: If your display panel and/or its driver chip(s) do not support rotation, :cpp:func:`lv_draw_sw_rotate` can be used to rotate the buffer in the :ref:`flush_callback` function.
it_it: Se il pannello di visualizzazione e/o i relativi chip driver non supportano la rotazione, è possibile utilizzare :cpp:func:`lv_draw_sw_rotate` per ruotare il buffer nella funzione :ref:`flush_callback`.

source: If your input device requires quirks, make sure they are installed as well (usually in ``/usr/share/libinput/*.quirks``).
it_it: Se il dispositivo di input richiede peculiarità, assicurarsi che siano installate (di solito in ``/usr/share/libinput/*.quirks``).

source: If your platform has other drawing units available, if they are configured to be used in ``lv_conf.h``, they are added to this list during LVGL's initialization.
it_it: Se la piattaforma dispone di altre unità di disegno, se sono configurate per essere utilizzate in ``lv_conf.h``, vengono aggiunte a questo elenco durante l'inizializzazione di LVGL.

source: If your project needs examples and/or demos, add these directories to your project.
it_it: Se il progetto necessita di esempi e/o demo, aggiungere queste directory al progetto.

source: If your screen stays black or only draws partially, you can try enabling direct rendering via ``LV_DISPLAY_RENDER_MODE_DIRECT``.
it_it: Se lo schermo rimane nero o disegna solo parzialmente, si può provare ad abilitare il rendering diretto tramite ``LV_DISPLAY_RENDER_MODE_DIRECT``.

source: If your system environment can provide higher precision (e.g., 1us), you can configure the profiler as follows:
it_it: Se l'ambiente di sistema fornisce una precisione maggiore (ad esempio, 1us), è possibile configurare il profiler come segue:

source: If your system supports ``printf``, you just need to enable :c:macro:`LV_LOG_PRINTF` in ``lv_conf.h`` to output log messages with ``printf``.
it_it: Se il sistema supporta ``printf``, è sufficiente abilitare :c:macro:`LV_LOG_PRINTF` in ``lv_conf.h`` per generare messaggi di log con ``printf``.

source: Ignored for hidden (``LV_OBJ_FLAG_HIDDEN``) or floating (``LV_OBJ_FLAG_FLOATING``) widgets.
it_it: Ignorato per i widget nascosti (``LV_OBJ_FLAG_HIDDEN``) o "floating" (``LV_OBJ_FLAG_FLOATING``).

source: Image
it_it: Immagine

source: Image Button
it_it: Pulsante Immagine

source: Image Caching
it_it: Caching delle Immagini

source: Image Decoders
it_it: Decoder di Immagini

source: Image Draw Descriptor
it_it: Descrittore di Disegno dell'Immagine

source: Image Font
it_it: Font Immagine

source: Image Post-Processing
it_it: Post-processing delle Immagini

source: Image Sources
it_it: Sorgenti di Immagini

source: Image Support
it_it: Supporto alle Immagini

source: Image caching may not be worth it if you have a deeply embedded target which decodes small images from a relatively fast storage medium.
it_it: La memorizzazione nella cache delle immagini potrebbe non essere utile se si dispone di un target profondamente integrato che decodifica immagini di piccole dimensioni da un supporto di memorizzazione relativamente veloce.

source: Image drawing, scaling, and rotation
it_it: Disegno, ridimensionamento e rotazione di immagini

source: Image flags (any of the ``LV_IMAGE_FLAGS_...`` enumeration values).
it_it: Flag dell'immagine (uno qualsiasi dei valori di enumerazione ``LV_IMAGE_FLAGS_...``).

source: Image font
it_it: Font immagine

source: Image format, size, and count limit.
it_it: Formato, dimensione e limite di conteggio delle immagini.

source: Image from variable and symbol
it_it: Immagine da variabile e simbolo

source: Image offset and styling
it_it: Offset e stile dell'immagine

source: Image recoloring
it_it: Ricolorazione dell'immagine

source: Image rotation in 0.1-degree units (e.g., 234 means 23.4\ |deg|\ ).
it_it: Rotazione dell'immagine in unità di 0,1 gradi (ad esempio, 234 significa 23,4 gradi).

source: Image source
it_it: Sorgente dell'immagine

source: Image source for the arc, or `NULL` if unused.
it_it: Sorgente dell'immagine per l'arco, o `NULL` se non utilizzato.

source: Image sources
it_it: Sorgenti delle immagini

source: Image sources are set by calling one of the ``..._set_src()`` functions.
it_it: Le sorgenti delle immagini vengono impostate chiamando una delle funzioni ``..._set_src()``.

source: Image styles
it_it: Stili per le Immagini

source: Image-Based Lighting (IBL) for realistic environmental lighting
it_it: "Image-Based Lighting (IBL)" [Illuminazione basata su immagini] per un'illuminazione ambientale realistica

source: Images
it_it: Immagini

source: Images and fonts are uploaded to the EVE chip's RAM_G as-needed during rendering.
it_it: Immagini e font vengono caricati nella RAM_G del chip EVE in base alle esigenze durante il rendering.

source: Images and fonts still need to be changed manually to adapt to a new DPI.
it_it: Le immagini e i font devono comunque essere modificati manualmente per adattarsi al nuovo DPI.

source: Images and labels are sometimes used to convey the same thing, such as describing what a button does.
it_it: Immagini ed etichette vengono talvolta utilizzate per comunicare la stessa cosa, ad esempio per descrivere la funzione di un pulsante.

source: Images are Widgets that display images from flash (as arrays) or from files.
it_it: Le immagini sono Widget che visualizzano immagini da Flash (come array) o da file.

source: Images can also display symbols (``LV_SYMBOL_...``).
it_it: Le immagini possono anche visualizzare simboli (``LV_SYMBOL_...``).

source: Images can be:
it_it: Le immagini possono essere:

source: Images stored as files are normally not linked into the resulting executable, and must be read into RAM before being drawn.
it_it: Le immagini memorizzate come file normalmente non sono linkate all'eseguibile risultante e devono essere lette nella RAM prima di essere disegnate.

source: Images stored as variables are comprised of an :cpp:struct:`lv_image_dsc_t` struct plus its data.
it_it: Le immagini memorizzate come variabili sono composte da una struttura :cpp:struct:`lv_image_dsc_t` più i suoi dati.

source: Images that are encoded (i.e. outside of the list of built-in supported :ref:`images_color_formats`) are dealt with through an Image Decoder.
it_it: Le immagini codificate (ovvero al di fuori dell'elenco dei formati di colore supportati :ref:`images_color_formats`) vengono gestite tramite un decodificatore di immagini.

source: Images with rotation are fine.
it_it: Le immagini con rotazione funzionano correttamente.

source: Imagine an instrument (e.g., a power supply) with 4 channels and "left", "right", and "OK" buttons for each channel to adjust them.
it_it: Immaginare uno strumento (ad esempio, un alimentatore) con 4 canali e pulsanti "sinistra", "destra" e "OK" per ogni canale per regolarli.

source: Imagine that in the example above ``my_icon`` defines a ``"show_up"`` timeline which fades in and enlarges the icon.
it_it: Si immagini che nell'esempio sopra ``my_icon`` definisca una timeline ``"show_up"`` che sfuma e ingrandisce l'icona.
